SiliconLabs/arduino/variants/bgm220explorerkit/noradio/include/nvm3_generic.h
/***************************************************************************//**
 * @file
 * @brief NVM3 API definition (Generic).
 *******************************************************************************
 * # License
 * <b>Copyright 2023 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#ifndef NVM3_GENERIC_H
#define NVM3_GENERIC_H

#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>

#include "sl_status.h"
#include "ecode.h"
#include "nvm3_hal.h"

#if defined(NVM3_SECURITY)
#include "nvm3_hal_crypto.h"
#endif

#ifdef __cplusplus
extern "C" {
#endif

/***************************************************************************//**
 * @addtogroup nvm3
 * @{
 ******************************************************************************/

#define ECODE_NVM3_OK                                 (SL_STATUS_OK)                                     ///< Success return value
#define ECODE_NVM3_ERR_ALIGNMENT_INVALID              (SL_STATUS_NVM3_ALIGNMENT_INVALID)                 ///< Invalid data alignment
#define ECODE_NVM3_ERR_SIZE_TOO_SMALL                 (SL_STATUS_NVM3_SIZE_TOO_SMALL)                    ///< Not enough NVM memory specified
#define ECODE_NVM3_ERR_NO_VALID_PAGES                 (SL_STATUS_NVM3_NO_VALID_PAGES)                    ///< Initialization aborted, no valid page found
#define ECODE_NVM3_ERR_PAGE_SIZE_NOT_SUPPORTED        (SL_STATUS_NVM3_PAGE_SIZE_NOT_SUPPORTED)           ///< The page size is not supported
#define ECODE_NVM3_ERR_OBJECT_SIZE_NOT_SUPPORTED      (SL_STATUS_NVM3_OBJECT_SIZE_NOT_SUPPORTED)         ///< The object size is not supported
#define ECODE_NVM3_ERR_STORAGE_FULL                   (SL_STATUS_FULL)                                   ///< No more NVM space available
#define ECODE_NVM3_ERR_NOT_OPENED                     (SL_STATUS_NOT_INITIALIZED)                        ///< The module has not been successfully opened
#define ECODE_NVM3_ERR_OPENED_WITH_OTHER_PARAMETERS   (SL_STATUS_NVM3_OPENED_WITH_OTHER_PARAMETERS)      ///< The module has already been opened with other parameters
#define ECODE_NVM3_ERR_PARAMETER                      (SL_STATUS_INVALID_PARAMETER)                      ///< Illegal parameter
#define ECODE_NVM3_ERR_KEY_INVALID                    (SL_STATUS_INVALID_KEY)                            ///< Invalid key value
#define ECODE_NVM3_ERR_KEY_NOT_FOUND                  (SL_STATUS_NOT_FOUND)                              ///< Key not found
#define ECODE_NVM3_ERR_OBJECT_IS_NOT_DATA             (SL_STATUS_NVM3_OBJECT_IS_NOT_DATA)                ///< Trying to access a data object which is currently a counter object
#define ECODE_NVM3_ERR_OBJECT_IS_NOT_A_COUNTER        (SL_STATUS_NVM3_OBJECT_IS_NOT_A_COUNTER)           ///< Trying to access a counter object which is currently a data object
#define ECODE_NVM3_ERR_ERASE_FAILED                   (SL_STATUS_FLASH_ERASE_FAILED)                     ///< Erase failed
#define ECODE_NVM3_ERR_WRITE_DATA_SIZE                (SL_STATUS_NVM3_WRITE_DATA_SIZE)                   ///< The object is too large
#define ECODE_NVM3_ERR_WRITE_FAILED                   (SL_STATUS_FLASH_PROGRAM_FAILED)                   ///< Error in the write operation
#define ECODE_NVM3_ERR_READ_DATA_SIZE                 (SL_STATUS_NVM3_READ_DATA_SIZE)                    ///< Trying to read with a length different from actual object size
#define ECODE_NVM3_ERR_READ_FAILED                    (SL_STATUS_OBJECT_READ)                            ///< Error in the read operation
#define ECODE_NVM3_ERR_INIT_WITH_FULL_NVM             (SL_STATUS_NVM3_INIT_WITH_FULL_NVM)                ///< The module was opened with a full NVM
#define ECODE_NVM3_ERR_RESIZE_PARAMETER               (SL_STATUS_NVM3_RESIZE_PARAMETER)                  ///< Illegal parameter
#define ECODE_NVM3_ERR_RESIZE_NOT_ENOUGH_SPACE        (SL_STATUS_NVM3_RESIZE_NOT_ENOUGH_SPACE)           ///< Not enough NVM to complete resize
#define ECODE_NVM3_ERR_ERASE_COUNT_ERROR              (SL_STATUS_NVM3_ERASE_COUNT_ERROR)                 ///< Erase counts are not valid
#define ECODE_NVM3_ERR_INT_WRITE_TO_NOT_ERASED        (SL_STATUS_NVM3_WRITE_TO_NOT_ERASED)               ///< Write to memory that is not erased
#define ECODE_NVM3_ERR_INT_ADDR_INVALID               (SL_STATUS_NVM3_INVALID_ADDR)                      ///< Invalid NVM address
#define ECODE_NVM3_ERR_INT_KEY_MISMATCH               (SL_STATUS_NVM3_KEY_MISMATCH)                      ///< Key validation failure
#define ECODE_NVM3_ERR_INT_SIZE_ERROR                 (SL_STATUS_NVM3_SIZE_ERROR)                        ///< Size mismatch error
#define ECODE_NVM3_ERR_INT_EMULATOR                   (SL_STATUS_NVM3_EMULATOR)                          ///< Emulator error
#define ECODE_NVM3_ERR_INT_TEST                       (SL_STATUS_FAIL)                                   ///< Internal Test error
#define ECODE_NVM3_ERR_NVM_ACCESS                     (SL_STATUS_NVM3_NVM_ACCESS)                        ///< A NVM function call was failing
#define ECODE_NVM3_ERR_ADDRESS_RANGE                  (SL_STATUS_NVM3_INVALID_ADDR)                      ///< Address and size is out of range of available NVM

/***************************************************************************//**
 *  @brief Definitions of NVM3 constraints.
 ******************************************************************************/
#define NVM3_MIN_PAGE_SIZE              4096U                           ///< The minimum page size supported
#define NVM3_MAX_OBJECT_SIZE_LOW_LIMIT  204U                            ///< The minimum value for the maximum object size
#define NVM3_MAX_OBJECT_SIZE_HIGH_LIMIT 4096U                           ///< The maximum value for the maximum object size
#define NVM3_MAX_OBJECT_SIZE_DEFAULT    1900U                           ///< The default value for the maximum object size

#if !defined(NVM3_MAX_OBJECT_SIZE)
#define NVM3_MAX_OBJECT_SIZE            NVM3_MAX_OBJECT_SIZE_DEFAULT    ///< The maximum object size
#endif

#if defined(NVM3_SECURITY)
#define NVM3_NONCE_SIZE                 (12U)
#define NVM3_GCM_TAG_SIZE               (4U)
#endif

/***************************************************************************//**
 *  @brief NVM3 static data definition helper macro for applications using linker
 *  script placement of the NVM memory area. This macro exports the section 'name'_section
 *  to the linker. The user must place the section name in a linker script
 *  at an address aligned with the page size of the underlying memory system. The size of
 *  the NVM area must be a multiple of the page size.
 *  @n This macro also allocates the static NVM3 cache.
 *  @n Use this macro with @ref NVM3_DEFINE_SECTION_INIT_DATA() to create initialization
 *  data for @ref nvm3_open(). See @ref nvm3_example section for usage examples.
 ******************************************************************************/
#define NVM3_DEFINE_SECTION_STATIC_DATA(name, nvmSize, cacheSize) \
  static nvm3_CacheEntry_t name##_cache[cacheSize];               \
  static const uint8_t name##_nvm[nvmSize]                        \
  SL_ATTRIBUTE_SECTION(STRINGIZE(name##_section))

/***************************************************************************//**
 *  @brief NVM3 initialization data helper macro to be used with @ref
 *  NVM3_DEFINE_SECTION_STATIC_DATA(). The @p name parameter in both macros must
 *  match.
 *  @n Call @ref nvm3_open() after this macro to initialize NVM3. See @ref
 *  nvm3_example section for code examples.
 ******************************************************************************/
#if defined(NVM3_SECURITY)
#define NVM3_DEFINE_SECTION_INIT_DATA(name, flashHandle, cryptoHandle) \
  nvm3_Init_t name =                                                   \
  {                                                                    \
    (nvm3_HalPtr_t)name##_nvm,                                         \
    sizeof(name##_nvm),                                                \
    name##_cache,                                                      \
    sizeof(name##_cache) / sizeof(nvm3_CacheEntry_t),                  \
    NVM3_MAX_OBJECT_SIZE,                                              \
    0,                                                                 \
    flashHandle,                                                       \
    cryptoHandle,                                                      \
    NVM3_DEFAULT_SECURITY_TYPE,                                        \
  }
#else
#define NVM3_DEFINE_SECTION_INIT_DATA(name, flashHandle) \
  nvm3_Init_t name =                                     \
  {                                                      \
    (nvm3_HalPtr_t)name##_nvm,                           \
    sizeof(name##_nvm),                                  \
    name##_cache,                                        \
    sizeof(name##_cache) / sizeof(nvm3_CacheEntry_t),    \
    NVM3_MAX_OBJECT_SIZE,                                \
    0,                                                   \
    flashHandle,                                         \
  }
#endif

#define NVM3_KEY_INVALID            0xFFFFFFFFU                   ///< Invalid key identifier
#define NVM3_KEY_SIZE               20U                           ///< Unique object key identifier size in number of bits
#define NVM3_KEY_MASK               ((1U << NVM3_KEY_SIZE) - 1U)  ///< Unique object key identifier mask
#define NVM3_KEY_MIN                0U                            ///< Minimum object key value
#define NVM3_KEY_MAX                NVM3_KEY_MASK                 ///< Maximum object key value

#define NVM3_OBJECTTYPE_DATA        0U                            ///< The object is data
#define NVM3_OBJECTTYPE_COUNTER     1U                            ///< The object is a counter

/// @brief The data type for object keys. Only the 20 least significant bits are used.
typedef uint32_t nvm3_ObjectKey_t;

/// @brief The datatype for each cache entry. The cache must be an array of these.
typedef struct nvm3_CacheEntry {
  nvm3_ObjectKey_t key;           ///< key
  void             *ptr;          ///< pointer
} nvm3_CacheEntry_t;

