SiliconLabs/arduino/variants/bgm220explorerkit/noradio/include/nvm3_generic.h
   @note Because the @ref nvm3_open may need to do recovery operations,
   the execution time will occasionally vary.

   # Storing Objects in Internal Flash {#nvm3_support_internal_flash}
   NVM3 has support for writing and reading objects in internal, i.e., memory-mapped
   Flash memory through the nvm3_hal_flash.c "driver". nvm3_hal_flash.c
   is using EMLIB functions to write and erase data while using regular
   memory functions to read data from Flash.

   @n The "driver" for internal Flash is selected by setting the halHandle in
   the nvm3_open initialization structure to point to nvm3_halFlashHandle.

   # Storing Objects in External Flash {#nvm3_support_external_flash}
   NVM3 has support for writing and reading objects in external Flash by using
   the nvm3_hal_flash_ext.c "driver". The nvm3_hal_flash_ext.c is using the SE
   manager functions to write and erase data while using regular memory
   functions to read data from external Flash.

   @n The "driver" for external Flash is selected by setting the halHandle in
   the nvm3_open initialization structure to point to nvm3_halFlashHandle.

   # Securing Objects in External Flash {#nvm3_support_secure_storage}
   All data objects are authenticated + encrypted using AES-GCM mode and
   counter objects are stored in plain. Each data object which is securely stored
   in external flash has a size overhead of 8 bytes. NVM3 uses device generated key
   for crypto operations. Reading the external memory directly (without using NVM3)
   will not give access to the unencrypted data objects.

   @n HAL for crypto is added to have the flexibility to use available crypto
   which can be selected by setting the halCryptoHandle in the nvm3_open
   initialization structure to point to desired crypto handle.

   @n NVM3 crypto key will be changed if "device erase" is triggered on a debug
   locked part, which will also clean up the NVM3 from the memory. In this case,
   if previously stored NVM3 data is reloaded to the same device, NVM3 data read
   will fail as NVM3 crypto key has changed.

   # NVM3 Source code {#nvm3_source_code}
   The NVM3 source code can be compiled for Cortex M4 and M33 with either ARM GCC
   or IAR toolchains. In addition, the NVM3 driver provides a means to securely
   store and retrieve the objects in external Flash using authenticated encryption.
   Objects in internal Flash need not be encrypted, while objects in external Flash
   must always be encrypted.

   # Storage Capacity {#nvm3_capacity}
   Basic storage is defined as the size of on instance of all objects, including
   any overhead stored with the data. For NVM3 the maximum amount of data you
   can store is dependent on the number of flash pages used for storage and the
   max object size used for NVM3. The following table shows the maximum allowed
   basic storage for a varying number of 4 kB or 8 kB flash pages and the minimum
   (204 bytes), default (254 bytes), high (1900 bytes) and maximum (4096 bytes)
   max object size. Note that this is a theoretical limit, and if the basic storage
   is at this limit, no space is left for wear-levelling, and page erases will be
   forced for every object written. The NVM3 instance should therefore be configured
   with enough flash pages to put the maximum allowed basic storage significantly
   higher than the actual basic storage.

   ## Max Allowed Basic Storage with 4 kB page size
   |                Flash pages    |                Total size (bytes)    |    Max allowed basic storage (bytes)    |                                     |                                      |                                      |
   |-------------------------------|--------------------------------------|-----------------------------------------|-------------------------------------|--------------------------------------|--------------------------------------|
   |                               |                                      |    Max object size = 204 bytes          |    Max object size = 254 bytes      |    Max object size = 1900 bytes      |    Max object size = 4096 bytes      |
   |    3                          |    12228                             |    3652                                 |    3552                             |    260                               |    0                                 |
   |    4                          |    16304                             |    7728                                 |    7628                             |    4336                              |    0                                 |
   |    5                          |    20380                             |    11804                                |    11704                            |    8412                              |    4020                              |
   |    6                          |    24456                             |    15880                                |    15780                            |    12488                             |    8096                              |
   |    7                          |    28532                             |    19956                                |    19856                            |    16564                             |    12172                             |
   |    8                          |    32608                             |    24032                                |    23932                            |    20640                             |    16248                             |
   |    9                          |    36684                             |    28108                                |    28008                            |    24716                             |    20324                             |
   |    10                         |    40760                             |    32184                                |    32084                            |    28792                             |    24400                             |

## Max Allowed Basic Storage with 8 kB page size
   |                Flash pages    |                Total size (bytes)    |    Max allowed basic storage (bytes)    |                                     |                                      |                                      |
   |-------------------------------|--------------------------------------|-----------------------------------------|-------------------------------------|--------------------------------------|--------------------------------------|
   |                               |                                      |    Max object size = 204 bytes          |    Max object size = 254 bytes      |    Max object size = 1900 bytes      |    Max object size = 4096 bytes      |
   |    3                          |    24516                             |    7748                                 |    7648                             |    4356                              |    0                                 |
   |    4                          |    32688                             |    15920                                |    15820                            |    12528                             |    8136                              |
   |    5                          |    40860                             |    24092                                |    23992                            |    20700                             |    16308                             |
   |    6                          |    49032                             |    32264                                |    32164                            |    28872                             |    24480                             |

